chore: remove outdated files
